import pandas as pd
df = pd.read_csv('greenhouse.csv')

#按时间范围筛选
# 先把“时间”列转成时间格式
df['时间'] = pd.to_datetime(df['时间'])
df = df.set_index('时间')  # 把时间列设为索引，就能按时间切片了
# 选7月1日到7月7日的数据
#july_first_week = df.loc['2025-07-01':'2025-07-07']
s = df.between_time('8:00', '9:00')#选每天8点到9点的数据
#先把时间索引恢复成列，方便提取小时、天
df=df.reset_index()
df['小时']=df['时间'].dt.hour#提取每条记录是几点
df['日期'] = df['时间'].dt.date#提取每条记录是哪天
# 按小时分组，统计每个小时的平均温度
hour=df.groupby('小时')['温度'].mean()#按小时分组，统计每个小时的平均温度
hour_temp=df.groupby('小时')['温度'].agg(['mean', 'max', 'min', 'std'])
#新变量名 = 数据表名.groupby('用来分组的列名')['要计算的目标列名'].agg(['统计函数1', '统计函数2', ...])
# 按日期+小时分组，统计每天每个小时的湿度平均值
day_hour=df.groupby(['日期', '小时'])['湿度'].mean()
print(hour,hour_temp,day_hour)

#1.重采样：把高频数据转成低频统计
#（比如1分钟1条的数据转成1小时或者1天的平均数据）
df['时间'] = pd.to_datetime(df['时间'])
df=df.set_index('时间')# 必须先把时间设为索引
#1分钟数据转成1小时平均数据：'1h'是1小时，'1d'是1天，'10min'是10分钟
hour=df.resample('1h').mean(numeric_only=True)
#把原本密集的每一分钟（或更细粒度）的数据，按“1小时”为单位打包，计算每一小时内所有数字列的平均值。
#把数据按“1天”为单位打包，从每天的数据中，挑出这一天的最高温度和最低湿度。
day=df.resample('1d').agg({'温度':'max','湿度':'min'})#计算“湿度”等多列数据，标准写法通常会使用字典结构
print(hour,day)
#2.滑动窗口平均：给传感器数据去噪
# （传感器数据有高频噪声，滑动平均之后曲线更平滑）
# 计算5个点的滑动平均（比如5分钟数据的滑动平均，滤除高频噪声）
df['温度_滑动平均'] = df['温度'].rolling(window=5).mean()
df['湿度_滑动平均'] = df['湿度'].rolling(window=5).mean()
df['温度_滑动']=df['温度'].rolling(window=6).mean()
'''
创建两个新列；.rolling(window=5)：它相当于拿了一个大小为 5 的“取景框”（滑动窗口）
从上往下在你的数据表上滑动。每次框住当前行以及它上面的4行（一共5个数据）
df['温度_滑动平均']= ：把计算出来的平均值，按顺序填入一个名为“温度_滑动平均”的全新列中
tips:因为凑不够 5 个数据，前4个时间的计算结果通常会显示为 NaN（缺失值/空值）。
'''
#相关性分析
#一键算出所有变量之间的相关系数，直接看哪个因素和你关心的指标最相关
#（比如温度和湿度的相关性、光照和CO₂的相关性）
corr_matrix = df.corr(numeric_only=True)#计算皮尔逊相关系数，范围-1到1，绝对值越大相关性越强
print(corr_matrix['温度'])#看其他变量和'温度'的相关性



